// --- iLibs
// Fonts
"font.size.small"                           = "12";
"font.size.normal"                          = "32";
"font.size.large"                           = "48";
"font.family.default"                       = "MammaGamma";
"font.family.fixed"                         = "Absolute";
"font.family.symbolic"                      = "Apple Symbols";

// Numbers
"time.day.suffix"                           = "th";
"time.day.suffix.one"                       = "st";
"time.day.suffix.two"                       = "nd";
"time.day.suffix.three"                     = "rd";

/* Strings that are the same everywhere. */
"common.title.notice"                       = "Notice";
"common.title.error"                        = "Error";
"common.button.okay"                        = "Okay";
"common.button.continue"                    = "Continue";
"common.button.next"                        = "Next";
"common.button.done"                        = "Done";
"common.button.back"                        = "Back";
"common.button.retry"                       = "Retry";
"common.button.abort"                       = "Abort";
"common.button.cancel"                      = "Cancel";
"common.button.upgrade"                     = "Upgrade";
"common.button.yes"                         = "Yes";
"common.button.no"                          = "No";
"common.button.no.kind"                     = "Rather Not";
"common.button.save"                        = "Save";
"common.button.sure"                        = "Sure!";
"common.button.thanks"                      = "Thanks";

/* Strings that describe error conditions. */
"error.connection"                          = "Could not connect to the server.";
"error.response.invalid"                    = "Incompatible server response.";
"error.response.outdated.required"          = "A new version is available.\nPlease upgrade before proceding.";
"error.response.outdated.optional"          = "A new version is available.";

// Global Config
"config.direction"                          = "ltr";

// Menu Items
"menu.config"                               = "Configuration";
"menu.config.music"                         = "Music";
"menu.config.off"                           = "Off";
"menu.config.on"                            = "On";
"menu.config.song.sequential"               = "Sequential";
"menu.config.song.random"                   = "Shuffle";
"menu.config.song.off"                      = "Off";
"menu.config.sound"                         = "Sound Effects";
"menu.continue"                             = "Continue Game";
"menu.game.end"                             = "End Game";
"menu.game.new"                             = "New Game";
"menu.moregames"                            = "More Games";
"menu.scores"                               = "Scores";
"menu.level.restart"                        = "Restart Level";
"menu.level.retry"                          = "Retry Level";
"menu.main"                                 = "Main Menu";

// Game Messages
"message.paused"                            = "Game Paused";
"message.unpaused"                          = "Game Resuming";
"message.level"                             = "Level %d";

// --- DeBlock Specific
// Menu Items
"menu.config.song.lev3"                     = "Lev3";
"menu.config.song.lopey"                    = "Lopey";
"menu.config.song.mjolnir"                  = "Mjolnir";
"menu.config.song.random"                   = "Shuffle";
"menu.game.mode.classic"                    = "Classic";
"menu.game.mode.timed"                      = "Timed";
"menu.strategy"                             = "Strategy";

// Game Messages
"message.flawless"                          = "Flawless!";

// Dialogs
"dialog.title.kidsMode"                     = "Kids Mode";

"dialog.title.new"                          = "New Game";
"dialog.text.new"                           = "You are about to start a new game and loose your current progress.";

"dialog.title.error.score.unavailable"      = "Scores Unavailable";
"dialog.text.error.score.unavailable"       = "Online scores were temporarily unavailable.\nDo you want to retry?";

"dialog.title.firsttime"                    = "Welcome to Deblock!";
"dialog.text.firsttime.strategy"            = "Since this is your first time,\ncheck out the «Strategy» guide.\n\nMain Menu ➡ More ➡ Strategy";
